import { isWebp, headerFixed }from './modules'
import tabs from './modules/tabs';
/* Раскомментировать для использования */
// import { MousePRLX } from './libs/parallaxMouse'

/* Раскомментировать для использования */
// import Swiper, { Navigation, Pagination } from 'swiper'

// Проверка браузера на поддерку .webp изображений ====================================================================================================================================================
isWebp()
// ====================================================================================================================================================

// Паралакс мышей ====================================================================================================================================================
// const mousePrlx = new MousePRLX({})
// ====================================================================================================================================================

// Фиксированный header ====================================================================================================================================================
// headerFixed()
// ====================================================================================================================================================
window.addEventListener('DOMContentLoaded', function() {
    tabs('.tabheader__item', '.tabcontent', '.tabheader__items', 'tabheader__item_active');
});